config.el
(setq user-full-name "Simone Tami"
      user-mail-address "simonetami1@gmail.com")

(setq doom-theme 'doom-one)
(setq display-line-numbers-type t)

(setq org-directory "~/mega/org/")

;; Ensure autosave is active globally
(setq auto-save-default t)
(setq auto-save-interval 20)  ;; keystrokes before autosave
(setq auto-save-timeout 2)    ;; seconds of idle before autosave

(setq projectile-project-search-path ("~/mega/uni/EE/Tesi/journal/org" . 1))
